src/cf/InformationRegisters/СопутствующиеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СопутствующиеТовары</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СопутствующийТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДобавленоАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СопутствующиеТовары/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	
	Если Параметры.Ключ.Пустой() И Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Номенклатура = Запись.СопутствующийТовар
		И Запись.Характеристика = Запись.ХарактеристикаСопутствующегоТовара Тогда
		СтрокаСообщения = НСтр("ru = 'Значения элементов групп ""Номенклатура"" и ""Сопутствующий товар"" не могут совпадать.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,,ЭтаФорма);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	Запись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СопутствующийТоварПриИзмененииНаСервере()
	Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	Запись.ХарактеристикаСопутствующегоТовара = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
КонецПроцедуры

&НаКлиенте
Процедура СопутствующийТоварПриИзменении(Элемент)
	СопутствующийТоварПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
